<?php

namespace Database\Seeders;

use App\Models\SchoolTool;
use Illuminate\Database\Seeder;

class SchoolToolSeeder extends Seeder
{
    public function run(): void
    {
        $tools = [
            [
                'id' => 1,
                'name' => 'كراس صفحة 64',
            ],
            [
                'id' => 2,
                'name' => 'كراس الرسم',
            ],
            [
                'id' => 3,
                'name' => 'أغلفة بلاستيكية للكراريس',
            ],
            [
                'id' => 4,
                'name' => 'اغلفة بلاستيكية للكتب',
            ],
            [
                'id' => 5,
                'name' => 'لوحة',
            ],
            [
                'id' => 6,
                'name' => 'ممسحة',
            ],
            [
                'id' => 7,
                'name' => 'مقلمة',
            ],
            [
                'id' => 8,
                'name' => 'سيالة زرقاء',
            ],
            [
                'id' => 9,
                'name' => 'سيالة خضراء',
            ],
            [
                'id' => 10,
                'name' => 'قلم رصاص',
            ],
            [
                'id' => 11,
                'name' => 'مبراة',
            ],
            [
                'id' => 12,
                'name' => 'ممحاة',
            ],
            [
                'id' => 13,
                'name' => 'علبة لستة (6) أقلام ملونة',
            ],
            [
                'id' => 14,
                'name' => 'علبة لستة (12) اقلام ملونة',
            ],
            [
                'id' => 15,
                'name' => 'مسطرة',
            ],
            [
                'id' => 16,
                'name' => 'قريصات',
            ],
            [
                'id' => 17,
                'name' => 'خشيبات',
            ],
            [
                'id' => 18,
                'name' => 'عجينة',
            ],
            [
                'id' => 19,
                'name' => 'اوراق ملونة',
            ],
            [
                'id' => 20,
                'name' => 'كراس اعمال تطبيقية (حجم صغير)',
            ],
            [
                'id' => 21,
                'name' => 'كوس',
            ],
            [
                'id' => 22,
                'name' => 'منقلة',
            ],
            [
                'id' => 23,
                'name' => 'مدور',
            ],
            [
                'id' => 24,
                'name' => 'كراس صفحة 48',
            ],
            [
                'id' => 25,
                'name' => 'كراس صفحة 32',
            ],
            [
                'id' => 26,
                'name' => 'كراس صفحة 120',
            ],
            [
                'id' => 27,
                'name' => 'كراس صفحة 96',
            ],
            [
                'id' => 28,
                'name' => 'كراس اعمال تطبيقية (حجم كبير)',
            ],
            [
                'id' => 29,
                'name' => 'كراس خاص بالموسيقى 32 صفحة (السولفيج)',
            ],
            [
                'id' => 30,
                'name' => 'بطاقات لاصقة',
            ],
            [
                'id' => 31,
                'name' => 'علبةاقلام ملونة',
            ],
            [
                'id' => 32,
                'name' => 'غراء',
            ],
            [
                'id' => 33,
                'name' => 'حافظة اوراق مزدوجة',
            ],
            [
                'id' => 34,
                'name' => 'ورق مليميتري',
            ],
            [
                'id' => 35,
                'name' => 'ورق شفاف',
            ],
            [
                'id' => 36,
                'name' => 'ورق مليميتري',
            ],
            [
                'id' => 37,
                'name' => 'ورق شفاف',
            ],
            [
                'id' => 38,
                'name' => 'الة حاسبة بسيطة',
            ],
            [
                'id' => 39,
                'name' => 'اوراق الرسم',
            ],
            [
                'id' => 40,
                'name' => 'قلم HB',
            ],
            [
                'id' => 41,
                'name' => 'قلم HB2',
            ],
            [
                'id' => 42,
                'name' => 'قلم HB',
            ],
            [
                'id' => 43,
                'name' => 'قلم HB',
            ],
            [
                'id' => 44,
                'name' => 'قلم HB',
            ],
            [
                'id' => 45,
                'name' => 'قلم B2',
            ],
            [
                'id' => 46,
                'name' => 'قلم B2',
            ],
            [
                'id' => 47,
                'name' => 'قلم B2',
            ],
            [
                'id' => 48,
                'name' => 'قلم B2',
            ],
            [
                'id' => 49,
                'name' => 'اقلام لباد',
            ],
            [
                'id' => 50,
                'name' => 'الوان مائية',
            ],
            [
                'id' => 51,
                'name' => 'فرشاة رقم 02',
            ],
            [
                'id' => 52,
                'name' => 'فرشاة رقم 03',
            ],
            [
                'id' => 53,
                'name' => 'كراس صفحة 288',
            ],
            [
                'id' => 54,
                'name' => 'الة حاسبة علمية',
            ],
            [
                'id' => 55,
                'name' => 'بدلة رياضية',
            ],
            [
                'id' => 56,
                'name' => 'حذاء رياضي',
            ],
            [
                'id' => 57,
                'name' => 'مقص',
            ],
            [
                'id' => 58,
                'name' => 'قلم رصاص HB8',
            ],
            [
                'id' => 59,
                'name' => 'ريشة',
            ],
            [
                'id' => 60,
                'name' => 'محفظة',
            ],
            [
                'id' => 61,
                'name' => 'مئزر',
            ],
            [
                'id' => 62,
                'name' => 'قلم احمر',
            ],
            [
                'id' => 63,
                'name' => 'شريط لاصق',
            ],
            [
                'id' => 64,
                'name' => 'حافظة اوراق شفافة',
            ],
            [
                'id' => 65,
                'name' => 'مصنف',
            ],
            [
                'id' => 66,
                'name' => 'اوراق فردية',
            ],
            [
                'id' => 67,
                'name' => 'كراس 192 صفحة',
            ],
        ];

        SchoolTool::insert($tools);
    }
}
