<?php

return [
    'families' => '[11,*]عائلة|[3,10]عائلات|{2}عائلتين',
    'roles' => '[11,*]دور|[3,10]أدوار|{2}دورين',
    'branches' => '[11,*]فرع|[3,10]فروع|{2}فرعين',
    'members' => '[11,*]عضو|[3,10]أعضاء|{2}عضوين',
    'zones' => '[11,*]منطقة|[3,10]مناطق|{2}منطقتين',
    'orphans' => '[11,*]يتيم|[3,10]أيتام|{2}يتيمين',
    'sponsors' => '[11,*]متكفل|[3,10]متكفلين|{2}متكفلين',
    'needs' => '[11,*]احتياج|[3,10]احتياجات|{2}احتياجين',
    'schools' => '[11,*]مدرسة خاصة|[3,10]مدارس خاصة|{2}مدرستين',
    'finances' => '[11,*]إيراد|[3,10]إيرادات|{2}إيرادين',
    'items' => '[11,*]عنصر|[3,10]عناصر|{2}عنصرين',
    'benefactors' => '[11,*]محسن|[3,10]محسنين|{2}محسنين',
    'committees' => '[11,*]لجنة|[3,10]لجان|{2}لجنتين',
    'students' => '[11,*]تلميذ|[3,10]تلاميذ|{2}تلميذين',
    'college_students' => '[11,*]طالب|[3,10]طلاب|{2}طالبين',
];
