<?php

return [
    'ramadan_basket' => 'تم فلتره النتائج لعرض فقط الأسر المستفيدة من قفة رمضان، يجب تحديث الأسر المراد عرضها هنا. ',
    'monthly_basket' => 'تم فلتره النتائج لعرض فقط الأسر المستفيدة من القفة الشهرية، يجب تحديث الأسر المراد عرضها هنا. ',
    'eid_suit' => 'تم فلتره النتائج لعرض فقط الأيتام المستفيدين من بدلة العيد، يجب تحديث الأيتام المراد عرضهم هنا. ',
    'eid_al_adha' => 'تم فلتره النتائج لعرض فقط الأسر المستفيدة من الأضحية، يجب تحديث الأسر المراد عرضها هنا. ',
    'babies_milk_and_diapers' => 'تم فلتره النتائج لعرض فقط الأسر المستفيدة من الحفاضات وحليب الأطفال، يجب تحديث الأسر المراد عرضها هنا. ',
    'school_entry' => 'تم فلتره النتائج لعرض فقط الأيتام المستفيدين من الحقائب المدرسية، يجب تحديث الأيتام المراد عرضهم هنا. ',
    'select_location' => 'حدد موقع الأسرة على الخريطة',
];
