<?php

return [
    'branch' => [
        'created' => '{0} قد أضاف فرع جديد :name في :city.|{1} قد أضافت فرع جديد :name في :city.',
        'updated' => '{0} قامت بتعديل الفرع :name |{1} قام بتعديل الفرع :name',
        'deleted' => '{0} قامت بحذف الفرع :name |{1} قام بحذف الفرع :name',
    ],
    'zone' => [
        'created' => '{0} قامت بإضافة منطقة جديدة :name |{1} قام بإضافة منطقة جديدة :name',
        'updated' => '{0} قامت بتعديل المنطقة :name |{1} قام بتعديل المنطقة :name',
        'deleted' => '{0} قامت بحذف المنطقة :name |{1} قام بحذف المنطقة :name',
    ],
    'family' => [
        'created' => '{0} قد قامت بإضافة عائلة جديدة تابعة للفرع :branch في المنطقة :zone. |{1} قد قام بإضافة عائلة جديدة تابعة للفرع :branch في المنطقة :zone.',
        'updated' => '{0} قامت بتحديث بيانات عائلة :name |{1} قام بتحديث بيانات عائلة :name',
        'deleted' => '{0} قامت بحذف عائلة :name |{1} قام بحذف عائلة :name',
    ],
    'orphan' => [
        'updated' => '{0} قامت بتحديث بيانات اليتيم :name |{1} قام بتحديث بيانات اليتيم :name',
        'deleted' => '{0} قامت بحذف اليتيم :name |{1} قام بحذف اليتيم :name',
    ],
    'sponsor' => [
        'updated' => '{0} قامت بتحديث بيانات الخاصة ب المتكفل :name |  قام بتحديث بيانات الخاصة ب المتكفل :name',
        'deleted' => '{0} قامت بحذف المتكفل :name |{1} قام بحذف المتكفل :name',
    ],
    'lesson' => [
        'created' => '{0} قامت بإضافة درس دعم :title تابع للمدرسة :school. |{1} قام بإضافة درس دعم :title تابع للمدرسة :school.',
        'updated' => '{0} قامت بتعديل بيانات درس الدعم :title |{1} قام بتعديل بيانات درس الدعم :title',
        'deleted' => '{0} قامت بحذف درس الدعم :title |{1} قام بحذف درس الدعم :title',
    ],
    'school' => [
        'created' => '{0} قامت بإضافة مدرسة دعم جديدة باسم :name |{1} قام بإضافة مدرسة دعم جديدة باسم :name',
        'updated' => '{0} قامت بتعديل بيانات مدرسة الدعم :name |{1} قام بتعديل بيانات مدرسة الدعم :name',
        'deleted' => '{0} قامت بحذف مدرسة الدعم :name |{1} قام بحذف مدرسة الدعم :name',
    ],
    'role' => [
        'created' => '{0} قامت بإضافة دور جديد. | {} قام بإضافة دور جديد.',
        'updated' => '{0} قامت بتعديل صلاحيات الدور :name. |{1} قام بتعديل صلاحيات الدور :name.',
        'deleted' => '{0} قامت بحذف الدور :name |{1} قام بحذف الدور :name',
    ],
    'transcript' => [
        'created' => '{0} قامت بإضافة تقرير جديد. |{1} قام بإضافة تقرير جديد.',
        'updated' => '{0} قامت بتعديل بيانات التقرير :name. |{1} قام بتعديل بيانات التقرير :name.',
        'deleted' => '{0} قامت بحذف التقرير :name. |{1} قام بحذف التقرير :name.',
    ],
    'benefactor' => [
        'created' => '{0} قامت بإضافة متكفل جديد. |{1} قام بإضافة متكفل جديد.',
        'updated' => '{0} قامت بتعديل بيانات المتكفل :name. |{1} قام بتعديل بيانات المتكفل :name.',
        'deleted' => '{0} قامت بحذف المتكفل :name. |{1} قام بحذف المتكفل :name.',
        'sponsorship_created' => '{0} قامت بإضافة تكفل جديدة. |{1} قام بإضافة تكفل جديدة.',
    ],
    'committee' => [
        'created' => '{0} قامت بإضافة لجنة جديدة. |{1} قام بإضافة لجنة جديدة.',
        'updated' => '{0} قامت بتعديل بيانات اللجنة :name. |{1} قام بتعديل بيانات اللجنة :name.',
        'deleted' => '{0} قامت بحذف اللجنة :name. |{1} قام بحذف اللجنة :name.',
    ],
    'member' => [
        'created' => '{0} قامت بإضافة عضو جديد. | {} قام بإضافة عضو جديد.',
        'updated' => '{0} قامت بتعديل بيانات العضو :name. |{1} قام بتعديل بيانات العضو :name.',
        'deleted' => '{0} قامت بحذف العضو :name. |{1} قام بحذف العضو :name.',
    ],
    'inventory' => [
        'add_to_inventory' => '{0} قامت بإضافة :name للمخزن (:qty :unit). | {} قام بإضافة :name للمخزن (:qty :unit).',
        'delete_from_inventory' => '{0} قامت بحذف :name من المخزن. | {1} قا بحذف :name من المخزن.',
        'update_inventory' => '{0} قامت بتعديل :name. |{1} قام بتعديل :name.',
    ],
    'need' => [
        'created' => '{0} قامت بإضافة احتياج خاص ب :name. |{1} قام بإضافة احتياج خاص ب :name.',
        'updated' => '{0} قامت بتحديث الاحتياج الخاص ب :name. |{1} قام بتحديث الاحتياج الخاص ب :name.',
        'deleted' => '{0} قامت بحذف الاحتياج الخاص ب :name. |{1} قام بحذف الاحتياج الخاص ب :name.',
    ],
    'monthly_basket_updated' => '{0} قامت بتعديل عناصر القفة الشهرية. |{1} قام بتعديل عناصر القفة الشهرية.',
    'ramadan_basket_updated' => '{0} قامت بتعديل عناصر القفة الشهرية. |{1} قام بتعديل عناصر القفة الشهرية.',
    'monthly_sponsorships_settings_updated' => '{0} قامت بتعديل إعدادات الخاصة بالقفة الشهرية. |{1} قام بتعديل إعدادات الخاصة بالقفة الشهرية.',
    'ramadan_sponsorships_settings_updated' => '{0} قامت بتعديل إعدادات الخاصة بقفة رمضان . |{1} قام بتعديل إعدادات الخاصة بقفة رمضان .',
    'eid_suit_orphans_list.saved' => '{0} قامت بحفظ قائمة الأيتام المستفيدين من بدلة العيد. |{1} قام بحفظ قائمة الأيتام المستفيدين من بدلة العيد.',
    'eid_al_adha_families_list.saved' => '{0} قامت بحفظ قائمة العائلات المستفيدة من الأضحية. |{1} قام بحفظ قائمة العائلات المستفيدة من الأضحية.',
    'babies_milk_and_diapers_list.saved' => '{0} قامت بحفظ قائمة الأيتام المستفيدين من الحفاضات و حليب الأطفال. |{1} قام بحفظ قائمة الأيتام المستفيدين من الحفاضات و حليب الأطفال.',
    'monthly_basket_families_list.saved' => '{0} قامت بحفظ قائمة العائلات المستفيدة من القفة الشهرية بإجمالي :families_count عائلة. |{1} قام بحفظ قائمة العائلات المستفيدة من القفة الشهرية.',
    'ramadan_basket_families_list.saved' => '{0} قامت بحفظ قائمة العائلات المستفيدة من قفة رمضان. |{1} قام بحفظ قائمة العائلات المستفيدة من قفة رمضان.',
    'school_entry_orphans_list.saved' => '{0} قامت بحفظ قائمة الأيتام المستفيدين من الحقائب المدرسية. |{1} قام بحفظ قائمة الأيتام المستفيدين من الحقائب المدرسية.',
    'data_exported' => 'تمت معالجة طلب تصدير بياناتك بنجاح. يمكنك الآن تنزيل ملف (ملفات) البيانات المصدرة من حسابك.',
    'eid_al_adha_family_status_changed' => '{0} قامت بتغيير حالة الاستفادة من الأضحية لعائلة :name. |{1} قام بتغيير حالة الاستفادة من الأضحية لعائلة :name.',
    'eid_suit_bulk_updated_infos' => '{0} قامت بتحديث بيانات  محل المتكفل ببدلة العيد ل :orphans_count يتيم. |{1} قام بتحديث بيانات المحل المتكفل ببدلة العيد ل :orphans_count يتيم.',
    'eid_suit_reset_infos' => '{0} قامت بإعادة تعيين بيانات المحلات المتكفلة ببدلة العيد. |{1} قام بإعادة تعيين بيانات المحلات المتكفلة ببدلة العيد.',
    'eid_suit_orphan_update_infos' => '{0} قامت بتحديث بيانات المحل المتكفل ببدلة العيد لليتيم :name. |{1} قام بتحديث بيانات المحل المتكفل ببدلة العيد لليتيم :name.',
    'school_tools_list_downloaded' => '{0} قامت بتحميل قائمة أدوات المدرسة. |{1} قام بتحميل قائمة أدوات المدرسة.',
    'new_school_year_started' => '{0} قامت ببدء سنة مدرسية جديدة. |{1} قام ببدء سنة مدرسية جديدة.',
];
