<?php

return [
    'profile_information' => 'معلومات الملف الشخصي',
    'profile_information_hint' => 'تحرير المعلومات الشخصية للمستخدم',
    'update_password' => 'تحديث كلمة المرور',
    'update_password_hint' => 'تأكد من أن حسابك يستخدم كلمة مرور عشوائية طويلة وعشوائية للبقاء آمنًا.',
    'delete_account' => 'حذف الحساب',
    'delete_account_hint' => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل نهائي. قبل حذف حسابك، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها.',
    'delete_account_confirm' => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل نهائي. يُرجى إدخال كلمة المرور الخاصة بك لتأكيد رغبتك في حذف حسابك نهائياً.',
    'notifications' => [
        'hint' => 'تخصيص تفضيلات الإشعارات.',
        'Notify me about' => 'تحب إشعارك عندما يكون',
        'families_changes' => 'تغيرات في العائلات',
        'families_changes_description' => 'تلقى إشعارات عند إنشاء، تعديل أو حذف عائلة، المتكفل، اليتيم او الاحتياج.',
        'branches_and_zones_changes' => 'تغيرات في الفروع والمناطق',
        'branches_and_zones_changes_description' => 'تلقى أشعارات عند أنشاء، تعديل او حذف فرع او منطقة.',
        'financial_changes' => 'تغيرات في المالية',
        'financial_changes_description' => 'تلقى أشعارات عند إضافة، تعديل أو حذف معاملة مالية (دخل او مصروف).',
        'schools_and_lessons_changes' => 'تغيرات في مدارس الدعم الخاصة او دروس الدعم ',
        'schools_and_lessons_changes_description' => 'تلقى أشعارات عند أنشاء، تعديل أو حذف مدرسة خاصة او درس من دروس الدعم.',
        'occasions_saves' => 'حفظ او تعديل قائمات المستفيدين',
        'occasions_saves_description' => 'تلقى إشعارات عند حفظ او تعديل قائمة المستفيدين من بدلة العيد، الأضحية، القفة الشهرية، قفة رمضان، الدخول المدرسي او حفاضات و حليب للأطفال.',
        'association_changes' => 'تغيرات في الجمعية',
        'association_changes_description' => 'تلقى أشعارات عند أنشاء، تعديل أو حذف عضو، دروس الدعم، مدارس الدعم الخاصة او الوظائف.',
    ],
];
