<?php

namespace App\Models;

use Eloquent;
use Illuminate\Database\Eloquent\Builder;
use Illuminate\Database\Eloquent\Model;
use Laravel\Scout\Searchable;
use Sushi\Sushi;

/**
 * @property int $id
 * @property string|null $level
 * @property string|null $phase
 *
 * @method static Builder|AcademicLevel newModelQuery()
 * @method static Builder|AcademicLevel newQuery()
 * @method static Builder|AcademicLevel query()
 * @method static Builder|AcademicLevel whereId($value)
 * @method static Builder|AcademicLevel whereLevel($value)
 * @method static Builder|AcademicLevel wherePhase($value)
 *
 * @mixin Eloquent
 */
class AcademicLevel extends Model
{
    use Searchable, Sushi;

    protected array $rows = [
        [
            'id' => 1,
            'level' => 'تحضيري',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 2,
            'level' => 'الأولى ابتدائي',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 3,
            'level' => 'الثانية ابتدائي',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 4,
            'level' => 'الثالثة ابتدائي',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 5,
            'level' => 'الرابعة ابتدائي',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 6,
            'level' => 'الخامسة ابتدائي',
            'phase' => 'الطور الابتدائي',
        ],
        [
            'id' => 7,
            'level' => 'الأولى المتوسط',
            'phase' => 'الطور المتوسط',
        ],
        [
            'id' => 8,
            'level' => 'الثانية المتوسط',
            'phase' => 'الطور المتوسط',
        ],
        [
            'id' => 9,
            'level' => 'الثالثة المتوسط',
            'phase' => 'الطور المتوسط',
        ],
        [
            'id' => 10,
            'level' => 'الرابعة المتوسط',
            'phase' => 'الطور المتوسط',
        ],
        [
            'id' => 11,
            'level' => 'الأولى ثانوي آداب',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 12,
            'level' => 'الأولى ثانوي علوم',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 13,
            'level' => 'الثانية ثانوي رياضيات',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 14,
            'level' => 'الثانية ثانوي تقني رياضي (هندسة مدنية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 15,
            'level' => 'الثانية ثانوي تقني رياضي (هندسة الطرائق)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 16,
            'level' => 'الثانية ثانوي تقني رياضي (هندسة ميكانيكية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 17,
            'level' => 'الثانية ثانوي تقني رياضي (هندسة كهربائية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 18,
            'level' => 'الثانية ثانوي علوم تجريبية',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 19,
            'level' => 'الثانية ثانوي تسيير و اقتصاد',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 20,
            'level' => 'الثانية ثانوي أدب و فلسفة',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 21,
            'level' => 'الثانية ثانوي لغات أجنبية (اللغة الألمانية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 22,
            'level' => 'الثانية ثانوي لغات أجنبية (اللغة الإسبانية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 23,
            'level' => 'الثانية ثانوي لغات أجنبية (اللغة الإيطالية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 24,
            'level' => 'الثالثة ثانوي رياضيات',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 25,
            'level' => 'الثالثة ثانوي تقني رياضي (هندسة مدنية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 26,
            'level' => 'الثالثة ثانوي تقني رياضي (هندسة الطرائق)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 27,
            'level' => 'الثالثة ثانوي تقني رياضي (هندسة ميكانيكية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 28,
            'level' => 'الثالثة ثانوي تقني رياضي (هندسة كهربائية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 29,
            'level' => 'الثالثة ثانوي علوم تجريبية',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 30,
            'level' => 'الثالثة ثانوي تسيير و إقتصاد',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 31,
            'level' => 'الثالثة ثانوي أدب و فلسفة',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 32,
            'level' => 'الثالثة ثانوي لغات أجنبية (اللغة الألمانية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 33,
            'level' => 'الثالثة ثانوي لغات أجنبية (اللغة الإسبانية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 34,
            'level' => 'الثالثة ثانوي لغات أجنبية (اللغة الإيطالية)',
            'phase' => 'الطور الثانوي',
        ],
        [
            'id' => 35,
            'level' => 'الأولى ليسانس',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 36,
            'level' => 'الثانية ليسانس',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 37,
            'level' => 'الثالثة ليسانس',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 38,
            'level' => 'الأولى ماستر',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 39,
            'level' => 'الثانية ماستر',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 40,
            'level' => 'الأولى دكتوراه',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 41,
            'level' => 'الثانية دكتوراه',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 42,
            'level' => 'الثالثة دكتوراه',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 43,
            'level' => 'الرابعة دكتوراه',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 44,
            'level' => 'الخامسة دكتوراه',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 45,
            'level' => 'متخرج',
            'phase' => 'الطور الجامعي',
        ],
        [
            'id' => 46,
            'level' => 'السنة الأولى',
            'phase' => 'الشبه طبي',
        ],
        [
            'id' => 47,
            'level' => 'السنة الثانية',
            'phase' => 'الشبه طبي',
        ],
        [
            'id' => 48,
            'level' => 'السنة الثالثة',
            'phase' => 'الشبه طبي',
        ],
        [
            'id' => 49,
            'level' => 'السنة الرابعة',
            'phase' => 'الشبه طبي',
        ],
        [
            'id' => 50,
            'level' => 'السنة الخامسة',
            'phase' => 'الشبه طبي',
        ],
        [
            'id' => 51,
            'level' => 'مفصول',
            'phase' => 'اخر',
        ],
        [
            'id' => 52,
            'level' => 'امي',
            'phase' => 'اخر',
        ],
        [
            'id' => 53,
            'level' => 'السنة الأولى',
            'phase' => 'التكوين المهني',
        ],
        [
            'id' => 54,
            'level' => 'السنة الثانية',
            'phase' => 'التكوين المهني',
        ],
        [
            'id' => 55,
            'level' => 'السنة الثالثة',
            'phase' => 'التكوين المهني',
        ],
    ];

    public function toSearchableArray(): array
    {
        return $this->toArray();
    }
}
