<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;
use Sushi\Sushi;

class SchoolTool extends Model
{
    use Sushi;

    protected array $rows = [
        [
            'id' => 1,
            'name' => 'كراس صفحة 64',
        ],
        [
            'id' => 2,
            'name' => 'كراس الرسم',
        ],
        [
            'id' => 3,
            'name' => 'أغلفة بلاستيكية للكراريس',
        ],
        [
            'id' => 4,
            'name' => 'اغلفة بلاستيكية للكتب',
        ],
        [
            'id' => 5,
            'name' => 'لوحة',
        ],
        [
            'id' => 6,
            'name' => 'ممسحة',
        ],
        [
            'id' => 7,
            'name' => 'مقلمة',
        ],
        [
            'id' => 6,
            'name' => 'سيالة زرقاء',
        ],
        [
            'id' => 7,
            'name' => 'سيالة خضراء',
        ],
        [
            'id' => 8,
            'name' => 'قلم رصاص',
        ],
        [
            'id' => 9,
            'name' => 'مبراة',
        ],
        [
            'id' => 10,
            'name' => 'ممحاة',
        ],
        [
            'id' => 11,
            'name' => 'علبة لستة (6) أقلام ملونة',
        ],
        [
            'id' => 12,
            'name' => 'علبة لستة (12) اقلام ملونة',
        ],
        [
            'id' => 13,
            'name' => 'مسطرة',
        ],
        [
            'id' => 14,
            'name' => 'قريصات',
        ],
        [
            'id' => 15,
            'name' => 'خشيبات',
        ],
        [
            'id' => 16,
            'name' => 'عجينة',
        ],
        [
            'id' => 17,
            'name' => 'اوراق ملونة',
        ],
        [
            'id' => 18,
            'name' => 'كراس اعمال تطبيقية (حجم صغير)',
        ],
        [
            'id' => 19,
            'name' => 'كوس',
        ],
        [
            'id' => 20,
            'name' => 'منقلة',
        ],
        [
            'id' => 21,
            'name' => 'مدور',
        ],
        [
            'id' => 22,
            'name' => 'كراس صفحة 48',
        ],
        [
            'id' => 23,
            'name' => 'كراس صفحة 32',
        ],
        [
            'id' => 24,
            'name' => 'كراس صفحة 120',
        ],
        [
            'id' => 25,
            'name' => 'كراس صفحة 96',
        ],
        [
            'id' => 26,
            'name' => 'كراس اعمال تطبيقية (حجم كبير)',
        ],
        [
            'id' => 27,
            'name' => 'كراس خاص بالموسيقى 32 صفحة (السولفيج)',
        ],
        [
            'id' => 28,
            'name' => 'بطاقات لاصقة',
        ],
        [
            'id' => 29,
            'name' => 'علبةاقلام ملونة',
        ],
        [
            'id' => 30,
            'name' => 'غراء',
        ],
        [
            'id' => 31,
            'name' => 'حافظة اوراق مزدوجة',
        ],
        [
            'id' => 32,
            'name' => 'ورق مليميتري',
        ],
        [
            'id' => 33,
            'name' => 'ورق شفاف',
        ],
        [
            'id' => 34,
            'name' => 'ورق مليميتري',
        ],
        [
            'id' => 35,
            'name' => 'ورق شفاف',
        ],
        [
            'id' => 36,
            'name' => 'الة حاسبة بسيطة',
        ],
        [
            'id' => 37,
            'name' => 'اوراق الرسم',
        ],
        [
            'id' => 38,
            'name' => 'قلم HB',
        ],
        [
            'id' => 39,
            'name' => 'قلم HB',
        ],
        [
            'id' => 40,
            'name' => 'قلم HB',
        ],
        [
            'id' => 41,
            'name' => 'قلم HB',
        ],
        [
            'id' => 42,
            'name' => 'قلم HB',
        ],
        [
            'id' => 43,
            'name' => 'قلم B2',
        ],
        [
            'id' => 44,
            'name' => 'قلم B2',
        ],
        [
            'id' => 45,
            'name' => 'قلم B2',
        ],
        [
            'id' => 46,
            'name' => 'قلم B2',
        ],
        [
            'id' => 47,
            'name' => 'اقلام لباد',
        ],
        [
            'id' => 48,
            'name' => 'الوان مائية',
        ],
        [
            'id' => 49,
            'name' => 'فرشاة رقم 02',
        ],
        [
            'id' => 50,
            'name' => 'فرشاة رقم 03',
        ],
        [
            'id' => 51,
            'name' => 'كراس صفحة 288',
        ],
        [
            'id' => 52,
            'name' => 'الة حاسبة علمية',
        ],
        [
            'id' => 53,
            'name' => 'بدلة رياضية',
        ],
        [
            'id' => 54,
            'name' => 'حذاء رياضي',
        ],
        [
            'id' => 55,
            'name' => 'مقص',
        ],
        [
            'id' => 56,
            'name' => 'قلم رصاص HB8',
        ],
        [
            'id' => 57,
            'name' => 'ريشة',
        ],
        [
            'id' => 58,
            'name' => 'محفظة',
        ],
        [
            'id' => 59,
            'name' => 'مئزر',
        ],
        [
            'id' => 60,
            'name' => 'قلم احمر',
        ],
        [
            'id' => 61,
            'name' => 'شريط لاصق',
        ],
        [
            'id' => 62,
            'name' => 'حافظة اوراق شفافة',
        ],
        [
            'id' => 63,
            'name' => 'مصنف',
        ],
        [
            'id' => 64,
            'name' => 'اوراق فردية',
        ],
    ];
}
