<?php

namespace App\Models;

use Eloquent;
use Illuminate\Database\Eloquent\Builder;
use Illuminate\Database\Eloquent\Model;
use Laravel\Scout\Searchable;
use Sushi\Sushi;

/**
 * @property int $id
 * @property string|null $speciality
 * @property string|null $division
 *
 * @method static Builder|VocationalTraining newModelQuery()
 * @method static Builder|VocationalTraining newQuery()
 * @method static Builder|VocationalTraining query()
 * @method static Builder|VocationalTraining whereDivision($value)
 * @method static Builder|VocationalTraining whereId($value)
 * @method static Builder|VocationalTraining whereSpeciality($value)
 *
 * @mixin Eloquent
 */
class VocationalTraining extends Model
{
    use Searchable, Sushi;

    protected array $rows = [
        [
            'id' => 1,
            'speciality' => 'بناء في التراث المبني',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 2,
            'speciality' => 'تقنية الحفاظ على التراث المبني',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 3,
            'speciality' => 'تقني في ترميم التراث المبني',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 4,
            'speciality' => 'ترميم المواقع الأثرية و المعالم التذكارية',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 5,
            'speciality' => 'الحفاظ على التراث المبني',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 6,
            'speciality' => 'تسيير أشغال ترميم التراث المبني',
            'division' => 'فن - ثقافة والتراث',
        ],
        [
            'id' => 7,
            'speciality' => 'المحاصيل تحت الدفيئة',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 8,
            'speciality' => 'زراعة الخضروات',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 9,
            'speciality' => 'زراعة الأشجار المثمرة',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 10,
            'speciality' => 'البستنة',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 11,
            'speciality' => 'الزراعات الكبرى',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 12,
            'speciality' => 'الزراعات الصحراوية',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 13,
            'speciality' => 'زراعة الحبوب',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 14,
            'speciality' => 'المشتلة',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 15,
            'speciality' => 'زراعة الكروم',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 16,
            'speciality' => 'زراعة الغابات',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 17,
            'speciality' => 'زراعة النباتات الطبية ،العطرية و الأعشاب',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 18,
            'speciality' => 'زراعة النخيل',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 19,
            'speciality' => 'تركيب وصيانة العشب الرياضي',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 20,
            'speciality' => 'البستنة والمساحات الخضراء',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 21,
            'speciality' => 'مصمم البساتين',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 22,
            'speciality' => 'حماية النباتات',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 23,
            'speciality' => 'زراعة الخضروات',
            'division' => 'الفالحـــة / الإنتاج النـــــباتي',
        ],
        [
            'id' => 24,
            'speciality' => 'تربية الدواجن',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 25,
            'speciality' => 'تربية أرانب',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 26,
            'speciality' => 'تربية الإبل',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 27,
            'speciality' => 'حالب الأبقار',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 28,
            'speciality' => 'تربية النحل',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 29,
            'speciality' => 'تربية الحيوانات المجترة',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 30,
            'speciality' => 'تربية الحيوانات الصغيرة',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 31,
            'speciality' => 'تربية الخيول',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 32,
            'speciality' => 'تربية الأبقار',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 33,
            'speciality' => 'تربية الأغنام والمعز',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 34,
            'speciality' => 'مساعد في الصحة الحيوانية',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 35,
            'speciality' => 'الإنتاج الحيواني / خيار: تربية الحيوانات المجترة',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 36,
            'speciality' => 'الإنتاج الحيواني / خيار: تربية الحيوانات الصغيرة',
            'division' => 'الفلاحة / الإنتاج الحيواني',
        ],
        [
            'id' => 37,
            'speciality' => 'تشغيل ألآت الطبع هيليو',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 38,
            'speciality' => 'تشغيل ألآت الطبع فليكسو',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 39,
            'speciality' => 'تشغيل ألات الطبع أوفست',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 40,
            'speciality' => 'تشغيل آلات التجليد الصناعي',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 41,
            'speciality' => 'الطبع الحرير ي',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 42,
            'speciality' => 'تشغيل وسائل الطبع / خيار : فليكسو و هيليو',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 43,
            'speciality' => 'التجليد الفني و ترميم الكتب',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 44,
            'speciality' => 'تشغيل ألآت الطبع',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 45,
            'speciality' => 'النشر',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 46,
            'speciality' => 'مخطط معلوماتي و مصمم',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 47,
            'speciality' => 'الاتصال و الصناعات المطبعية / خيار : دراسة وإنجاز المنتجات التخطيطية',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 48,
            'speciality' => 'الاتصال و الصناعات المطبعية خيار: دراسة وإنجاز المنتجات المطبعية',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 49,
            'speciality' => 'الاتصال المطبعي / خيار؛ ابتكار لوازم التغليف',
            'division' => 'الفنون و الصناعة المطبعية',
        ],
        [
            'id' => 50,
            'speciality' => 'النقش على الخشب',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 51,
            'speciality' => 'الحدادة الفنية',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 52,
            'speciality' => 'النقش على الجبس',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 53,
            'speciality' => 'صناعة خزافة /تخصص فخار',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 54,
            'speciality' => 'النسيج التقليدي',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 55,
            'speciality' => 'النحاسيات',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 56,
            'speciality' => 'السلالة',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 57,
            'speciality' => 'النقش على الرخام و الحجر',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 58,
            'speciality' => 'صناعة الحلى التقليدي',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 59,
            'speciality' => 'الطرز',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 60,
            'speciality' => 'طلاء، حروف و زخرفة',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 61,
            'speciality' => 'زخرفة على الزجاج',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 62,
            'speciality' => 'نفخ على الزجاج',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 63,
            'speciality' => 'صناعة الخزف/ تخصص الزليج',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 64,
            'speciality' => 'المنسوج',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 65,
            'speciality' => 'الفريدة',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 66,
            'speciality' => 'الطرز التقليدي',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 67,
            'speciality' => 'الفخار التقليدي',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 68,
            'speciality' => 'صناعة السروج',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 69,
            'speciality' => 'المنتجات الجلدية التقليدية',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 70,
            'speciality' => 'الألبسة التقليدية',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 71,
            'speciality' => 'صياغة المجوهرات',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 72,
            'speciality' => 'صناعة و صيانة الآلات الموسيقية الوترية',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 73,
            'speciality' => 'فن الخط',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 74,
            'speciality' => 'فن الزجاج لتخصص الزجاج الملون',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 75,
            'speciality' => 'صياغة وصناعة الحلى',
            'division' => 'الحرف التقليدية',
        ],
        [
            'id' => 76,
            'speciality' => 'النجارة المعمارية',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 77,
            'speciality' => 'هياكل البناء الخشبية',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 78,
            'speciality' => 'نجارة الهياكل البحرية',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 79,
            'speciality' => 'نجارة الأثاث',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 80,
            'speciality' => 'نجارة التنضيد',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 81,
            'speciality' => 'الصناعات الخشبية',
            'division' => 'الخشب و التأثيث',
        ],
        [
            'id' => 82,
            'speciality' => 'صيانة الطرقات',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 83,
            'speciality' => 'إنجاز سابق الإجهاد',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 84,
            'speciality' => 'التركيب الصحي',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 85,
            'speciality' => 'بناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 86,
            'speciality' => 'القولبة والتسليح',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 87,
            'speciality' => 'المساكة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 88,
            'speciality' => 'نحت و تركيب الحجر والرخام',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 89,
            'speciality' => 'التجصيص',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 90,
            'speciality' => 'طلاء و تركيب الزجاج',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 91,
            'speciality' => 'دهن الإيبوكسي للأرضيات و الجدران',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 92,
            'speciality' => 'البلاط ، الخزف و الفسيفساء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 93,
            'speciality' => 'التركيب الصحي و الغاز',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 94,
            'speciality' => 'التدفئة المركزية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 95,
            'speciality' => 'التجصيص و تركيب الصفائح الجصية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 96,
            'speciality' => 'تركيب و كساء الواجهات',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 97,
            'speciality' => 'عامل في مخبر ميكانيك التربة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 98,
            'speciality' => 'البناء الموسع',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 99,
            'speciality' => 'هياكل البناء الخشبية والسقوف',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 100,
            'speciality' => 'تلبيس الأرضيات الرياضية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 101,
            'speciality' => 'تلبيس الأرضيات',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 102,
            'speciality' => 'الطوبوغرافيا',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 103,
            'speciality' => 'متابعة الإنجاز في البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 104,
            'speciality' => 'إعادة تأهيل البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 105,
            'speciality' => 'العزل الحراري و الصوتي',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 106,
            'speciality' => 'تقني في التعمير',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 107,
            'speciality' => 'التركيب في التهوية وتكييف الهواء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 108,
            'speciality' => 'متار جميع عناصر البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 109,
            'speciality' => 'تقني في ميكانيكا التربة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 110,
            'speciality' => 'تقني في الأشغال العمومية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 111,
            'speciality' => 'الطرق و الشبكات المختلفة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 112,
            'speciality' => 'رسم الدراسة / خيار ؛ هندسة معمارية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 113,
            'speciality' => 'رسم الدراسة / خيار ؛ خرسانة مسلحة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 114,
            'speciality' => 'الأشغال العمومية و المنشآت الفنية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 115,
            'speciality' => 'الطاقة الأمثل للبنايات',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 116,
            'speciality' => 'الأشغال الجيوتقنية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 117,
            'speciality' => 'مساح طوبوغرافي',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 118,
            'speciality' => 'مسير أشغال البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 119,
            'speciality' => 'الطرق و الشبكات المختلفة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 120,
            'speciality' => 'مسير الأشغال العمومية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 121,
            'speciality' => 'متار محقق و دراسة الأسعار',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 122,
            'speciality' => 'رسام مسقط في الهندسة المعمارية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 123,
            'speciality' => 'رسام مسقط في الخرسانة المسلحة',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 124,
            'speciality' => 'التعمير',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 125,
            'speciality' => 'التركيب الصحي التدفئة والتكييف',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 126,
            'speciality' => 'مصمم المجسمات في البناء و الأشغال العمومية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 127,
            'speciality' => 'الهندسة المعمارية الداخلية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 128,
            'speciality' => 'إعادة تأهيل و تجديد البنايات',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 129,
            'speciality' => 'طرق وتنظيم ورشة البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 130,
            'speciality' => 'دراسة و اقتصاد البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 131,
            'speciality' => 'تصميم الخرائط',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 132,
            'speciality' => 'الطاقات المتجددة في مجال البناء',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 133,
            'speciality' => 'تركيب وصيانة شبكات الموانع الطبية',
            'division' => 'البناء والأشغال العمومية',
        ],
        [
            'id' => 134,
            'speciality' => 'صناعة التجهيزات وقطع الغيار الخاصة بمادة البوليستر المقوى بألياف الزجاج',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 135,
            'speciality' => 'تصفيح راتنج بوليستر',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 136,
            'speciality' => 'صناعة البلاستيك',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 137,
            'speciality' => 'تشكيل المطاط الإصطناعي',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 138,
            'speciality' => 'تقني في الكيمياء',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 139,
            'speciality' => 'تحويل البلاستيك',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 140,
            'speciality' => 'صناعة الورق و الورق المقوى',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 141,
            'speciality' => 'كيمياء الطلاء ، الغراء والبرنيق',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 142,
            'speciality' => 'إنتاج الزجاج والمرايا',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 143,
            'speciality' => 'تحويل تشكيلات المطاط الإصطناعي',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 144,
            'speciality' => 'مراقبة نوعية المواد البلاستيكية',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 145,
            'speciality' => 'مراقبة نوعية المواد المطهرة و مواد التجميل',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 146,
            'speciality' => 'مراقبة نوعية المصنوعات الزجاجية',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 147,
            'speciality' => 'مراقبة نوعية المطاط الاصطناعي',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 148,
            'speciality' => 'الكيمياء الصناعية',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 149,
            'speciality' => 'نظافة، أمن و البيئة',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 150,
            'speciality' => 'الصناعات البلاستيكية',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 151,
            'speciality' => 'الصناعات الورقية /خيار تحويل الورق و الورق المقوى',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 152,
            'speciality' => 'صيانة أنظمة أنابيب البوليستر والمقوى بالألياف الزجاجية',
            'division' => 'الكيمياء الصناعية والبلاستيك',
        ],
        [
            'id' => 153,
            'speciality' => 'مطالة و هياكل المركبات',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 154,
            'speciality' => 'تلحيم',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 155,
            'speciality' => 'قفالة',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 156,
            'speciality' => 'مطالة وهياكل المركبات و الطلاء',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 157,
            'speciality' => 'نجارة معدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 158,
            'speciality' => 'نجارة الألومنيوم والمواد البلاستيكية (PVC)',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 159,
            'speciality' => 'هياكل المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 160,
            'speciality' => 'عامل في الطلاء الصناعي',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 161,
            'speciality' => 'صناعة القدور المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 162,
            'speciality' => 'تلحيم الأنابيب',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 163,
            'speciality' => 'مراقبة النوعية البعدية فى الإنشاءات المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 164,
            'speciality' => 'الرسم في الإنشاءات المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 165,
            'speciality' => 'مراقبة التلحيم',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 166,
            'speciality' => 'صناعة منتوجات نجارة الألومينيوم و البلاستيك (PVC)',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 167,
            'speciality' => 'تنظيم و إطلاق الإنشاءات المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 168,
            'speciality' => 'هياكل المركبات و الطلاء',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 169,
            'speciality' => 'تلحيم الصفائح والمجنبات',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 170,
            'speciality' => 'تحضيرات وطرق الإنشاءات المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 171,
            'speciality' => 'رسم الدراسات في الإنشاءات المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 172,
            'speciality' => 'قدور و أنابيب صناعية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 173,
            'speciality' => 'الدراسات في الهيكلة المعدنية',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 174,
            'speciality' => 'الدراسات و التصاميم في نجارة الألومينيوم و المواد البلاستيكية (PVC)',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 175,
            'speciality' => 'تلحيم الصناعي',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 176,
            'speciality' => 'تصميم وإنجاز هياكل السيارات',
            'division' => 'الإنشاءات المعدنية',
        ],
        [
            'id' => 177,
            'speciality' => 'القولبة في السباكة',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 178,
            'speciality' => 'تفريز',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 179,
            'speciality' => 'شخذ',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 180,
            'speciality' => 'تجليخ',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 181,
            'speciality' => 'السباكة',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 182,
            'speciality' => 'خراطة',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 183,
            'speciality' => 'الصيانة الميكانيكية في الإنشاءات الميكانيكية والصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 184,
            'speciality' => 'إستصناع',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 185,
            'speciality' => 'إستصناع بالمخرطة ذات التحكم الرقمي',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 186,
            'speciality' => 'التركيب و الضبط في الإنشاءات الميكانيكية و الصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 187,
            'speciality' => 'التحضير والطرق في الإنشاءات الميكانيكية والصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 188,
            'speciality' => 'علم القياس ومراقبة النوعية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 189,
            'speciality' => 'الرسم في دراسات الإنشاءات الميكانيكية والصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 190,
            'speciality' => 'الصيانة الصناعية في الإنشاءات الميكانيكية والصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 191,
            'speciality' => 'الأنتيجة الميكانيكة / خيار : إستصناع',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 192,
            'speciality' => 'الأنتيجة الميكانيكية / خيار : الآت وأدوات التصليح',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 193,
            'speciality' => 'إستصناع بالسحج',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 194,
            'speciality' => 'الصيانة الصناعية في الإنشاءات الميكانيكية والصناعة الحديدية',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 195,
            'speciality' => 'دراسة و إنجاز ألات وأدوات التصليح',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 196,
            'speciality' => 'تشكيل المواد بالتطريق',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 197,
            'speciality' => 'الأنتيجة الميكانيكة / خيار : استصناع',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 198,
            'speciality' => 'سباكة المزائج المقولبة',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 199,
            'speciality' => 'معالجة المواد',
            'division' => 'الإنشاءات الميكانيكية والصناعة الحديدية',
        ],
        [
            'id' => 200,
            'speciality' => 'الألبسة الجلدية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 201,
            'speciality' => 'خياطة تركيب الأحذية المنتجات الجلدية و',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 202,
            'speciality' => 'تركيب وتشطيب الأحذية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 203,
            'speciality' => 'السكافة وتصليح منتجات المواد اللينة',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 204,
            'speciality' => 'التجهيز و التأثيث الداخلي للمر كيات',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 205,
            'speciality' => 'مشعل ألآلات الميكانيكية للدباغة',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 206,
            'speciality' => 'المنتجات الجلدية الصناعية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 207,
            'speciality' => 'عامل في تحضير الدباغة',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 208,
            'speciality' => 'مفصل، محضر الأحذية ، المنتاجات الجلدية القفاز و الملابس الجلدية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 209,
            'speciality' => 'نموذج تدرج للأحذية والمواد الليفة',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 210,
            'speciality' => 'الأحذية و المنتجات الجلدية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 211,
            'speciality' => 'الصناعة الجلدية / خيار: دباغة- بياضة',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 212,
            'speciality' => 'التصنيع والإنتاج الآلي للأحذية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 213,
            'speciality' => 'مراقبة الجودة في الصناعات الجلدية',
            'division' => 'الصناعة الجلدية',
        ],
        [
            'id' => 214,
            'speciality' => 'كهرباء السيارات',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 215,
            'speciality' => 'الكهرباء الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 216,
            'speciality' => 'الكهرباء المعمارية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 217,
            'speciality' => 'تركيب الألواح الشمسية، الضوئية و الحرارية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 218,
            'speciality' => 'تركيب و صيانة أجهزة التبريد و التكييف',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 219,
            'speciality' => 'تصليح الأجهزة الكهرومنزلية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 220,
            'speciality' => 'الكهروتقني',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 221,
            'speciality' => 'تصليح وصيانة أجهزة النسخ التصويري',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 222,
            'speciality' => 'الكترونيك السيارات',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 223,
            'speciality' => 'الإلكترونيك الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 224,
            'speciality' => 'التبريد الصناعي و التكييف',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 225,
            'speciality' => 'الكهروميكانيك',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 226,
            'speciality' => 'صيانة التجهيزات ألمعلوماتية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 227,
            'speciality' => 'تركيب و صيانة الألواح الشمسية، الضوئية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 228,
            'speciality' => 'تركيب و صيانة الألواح الشمسية، الحرارية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 229,
            'speciality' => 'تركيب و تصليح الأجهزة الكهرومنزلية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 230,
            'speciality' => 'صيانة المصاعد',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 231,
            'speciality' => 'التلفيف الكهربائي',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 232,
            'speciality' => 'تركيب و صيانة التوليد بالرياح',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 233,
            'speciality' => 'تركيب وصيانة أنظمة الإنذار و المراقبة بالفيديو',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 234,
            'speciality' => 'صيانة الأنظمة الميكانيكية الآلية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 235,
            'speciality' => 'الصيانة الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 236,
            'speciality' => 'الكهرباء الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 237,
            'speciality' => 'تركيب تجهيزات التبريد والتكييف',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 238,
            'speciality' => 'صيانة تجهيزات المعلوماتية و المكتبية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 239,
            'speciality' => 'صيانة الأجهزة السمعية البصرية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 240,
            'speciality' => 'ألإلكترونيك الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 241,
            'speciality' => 'الآلية و الضبط',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 242,
            'speciality' => 'صيانة المعدات الطبية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 243,
            'speciality' => 'ميتورولوجيا وأدوات الضبط',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 244,
            'speciality' => 'التشغيل الألي للمنازل',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 245,
            'speciality' => 'صيانة الأنظمة الميكانيكية الآلية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 246,
            'speciality' => 'الفعالية الطاقوية و الآلية الصناعية',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 247,
            'speciality' => 'صيانة أنظمة الإنتاج',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 248,
            'speciality' => 'صيانة أنظمة الطاقات و السوائل',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 249,
            'speciality' => 'صيانة أنظمة التوليد بالرياح',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 250,
            'speciality' => 'تركيب و صيانة المصاعد',
            'division' => 'الكهرباء - الإلكترونيك - طاقوية',
        ],
        [
            'id' => 251,
            'speciality' => 'صناعة الحلويات',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 252,
            'speciality' => 'الخبازة الفطائر',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 253,
            'speciality' => 'الإطعام / خيار: الطبخ التقليدي',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 254,
            'speciality' => 'الإطعام / خيار : طبخ الجماعي',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 255,
            'speciality' => 'الفندقة الإطعام / خيار : الإطعام',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 256,
            'speciality' => 'الفندقة - الإطعام / خيار : الطبخ',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 257,
            'speciality' => 'الفندقة - الإطعام / خيار : خدمات المقهى',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 258,
            'speciality' => 'الفندقة / خيار : خدمات فندقية',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 259,
            'speciality' => 'الفندقة / خيار : الاستقبال',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 260,
            'speciality' => 'الفندقة - الإطعام / خيار : جزارة فندقية',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 261,
            'speciality' => 'الفندقة - الإطعام / خيار :الإنتاج المطبخي',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 262,
            'speciality' => 'الفندقة - الإطعام / خيار : خدمات المطعم',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 263,
            'speciality' => 'الفندقة / خيار : الإستقبال',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 264,
            'speciality' => 'الفندقة / خيار : الإيواء',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 265,
            'speciality' => 'السياحة / خيار: وكالة الأسفار',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 266,
            'speciality' => 'الفندقة و الإطعام / خيار: فن الخدمة الطاولة',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 267,
            'speciality' => 'الفندقة و الإطعام / خيار : فن الطبخ',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 268,
            'speciality' => 'الفندقة - الإطعام / خيار : الطبخ التقليدي',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 269,
            'speciality' => 'الفندقة / خيار: تسيير و إدارة الفنادق',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 270,
            'speciality' => 'المناجمنت في الفنادق و الإطعام',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 271,
            'speciality' => 'السياحة / خيار : الإنتاج والتسويق',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 272,
            'speciality' => 'التنشيط و التسيير السياحي',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 273,
            'speciality' => 'السياحة / خيار: مرشد المتاحف',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 274,
            'speciality' => 'السياحة / خيار: وكالة الأسفار',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 275,
            'speciality' => 'التسيير الفندقي / خيار: الإيواء',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 276,
            'speciality' => 'التسيير الفندقي / خيار: الاستقبال',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 277,
            'speciality' => 'السياحة / خيار: المرشد السياحة المحلية',
            'division' => 'الفندقة - الإطعام و السياحة',
        ],
        [
            'id' => 278,
            'speciality' => 'تحضير المشروبات و المعلبات',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 279,
            'speciality' => 'إنتاج زيت الزيتون',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 280,
            'speciality' => 'تحضير المواد الدسمة',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 281,
            'speciality' => 'تحضير الحلوى ، الشكولاطة و البسكويت',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 282,
            'speciality' => 'جزارة و منتجات اللحوم',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 283,
            'speciality' => 'تحويل التمور',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 284,
            'speciality' => 'حفظ وتحويل منتجات الصيد البحري',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 285,
            'speciality' => 'صناعة الأجبان',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 286,
            'speciality' => 'إنتاج و تصفية الزيوت الغذائية',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 287,
            'speciality' => 'إنتاج أغذية الحيوانات',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 288,
            'speciality' => 'تكنولوجيا صنع الحلوى، الشكولاطة و البسكويت',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 289,
            'speciality' => 'تعبئة وتغليف المواد الزراعية الغدائية',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 290,
            'speciality' => 'تكنولوجيا تحويل التمور',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 291,
            'speciality' => 'تحويل اللحوم',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 292,
            'speciality' => 'تحويل الحليب',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 293,
            'speciality' => 'مراقبة، تعبئة وتعليف منتجات الحليب',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 294,
            'speciality' => 'الأجبان ومشتقات الحليب',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 295,
            'speciality' => 'إنتاج المشروبات والمعلبات',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 296,
            'speciality' => 'تحويل الحبوب',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 297,
            'speciality' => 'مراقبة النوعية في الصناعات الغذائية',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 298,
            'speciality' => 'إنتاج المواد الدسمة',
            'division' => 'صناعة الأغذية الزراعية',
        ],
        [
            'id' => 299,
            'speciality' => 'تقني في أرضيات النفط',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 300,
            'speciality' => 'ميكانيكي المسابر',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 301,
            'speciality' => 'كهرباني المسابر',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 302,
            'speciality' => 'أشغال الآبار',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 303,
            'speciality' => 'الصناعات النفطية/ خيار :أشغال الآبار',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 304,
            'speciality' => 'الصناعات النفطية/ خيار القياس',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 305,
            'speciality' => 'الصناعات النفطية/ خيار :أليات الضبط',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 306,
            'speciality' => 'الصناعات النفطية/ خيار : الوقاية و الأمن الصناعي',
            'division' => 'الصناعات النفطية',
        ],
        [
            'id' => 307,
            'speciality' => 'صيانة الهاتف الثابت و النقالة',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 308,
            'speciality' => 'عامل في الميكرومعلوماتية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 309,
            'speciality' => 'تركيب و تصليح تجهيزات الإتصال اللاسلكي',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 310,
            'speciality' => 'مستغل المعلوماتية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 311,
            'speciality' => 'مساعد الوسائط الإعلامية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 312,
            'speciality' => 'إعلام آلي / خيار : البرمجة',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 313,
            'speciality' => 'معلوماتية التسيير',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 314,
            'speciality' => 'تركيب شبكات الاتصال اللاسلكي',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 315,
            'speciality' => 'إعلام ألي / خيار: قاعدة المعطيات',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 316,
            'speciality' => 'إعلام ألي / خيار: صيانة الأنظمة المعلوماتية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 317,
            'speciality' => 'تركيب الألياف البصرية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 318,
            'speciality' => 'إعلام آلي / خيار : مطور الواب والوسائط الإعلامية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 319,
            'speciality' => 'الأنظمة الرقمية/ خيار: المعلوماتية والشبكات المعلوماتية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 320,
            'speciality' => 'إدارة وأمن شبكات المعلوماتية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 321,
            'speciality' => 'الاتصالات',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 322,
            'speciality' => 'طاقة ومحيط الإتصال',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 323,
            'speciality' => 'راديو - الاتصالات',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 324,
            'speciality' => 'شبكات الاتصال السلكية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 325,
            'speciality' => 'إدارة الحوسبة السحابية والمحاكاة الافتراضية',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 326,
            'speciality' => 'إدارة مركز البيانات',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 327,
            'speciality' => 'إعلام آلى / خيار : مطور تطبيقات متعددة المنصات',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 328,
            'speciality' => 'إدارة الهائف عبر voip',
            'division' => 'إعلام آلي - الرقمنة - الإتصالات',
        ],
        [
            'id' => 329,
            'speciality' => 'تسيير وفرز النفايات',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 330,
            'speciality' => 'تركيب القنوات',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 331,
            'speciality' => 'الصرف الصحي وجمع النفايات الخاصة',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 332,
            'speciality' => 'تسيير النفايات الخطيرة',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 333,
            'speciality' => 'إعادة تأهيل وصيانة المنشآت الهيدروتقنية',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 334,
            'speciality' => 'صيانة المسابح',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 335,
            'speciality' => 'صيانة شبكات التطهير',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 336,
            'speciality' => 'صيانة شبكات التزويد بالماء الشروب',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 337,
            'speciality' => 'التزويد بالماء الشروب',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 338,
            'speciality' => 'معالجة النفايات',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 339,
            'speciality' => 'استغلال محطات تطهير المياه',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 340,
            'speciality' => 'ممون مياه السقي',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 341,
            'speciality' => 'استغلال السدود',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 342,
            'speciality' => 'فحص ألمنشآت الهيدروتقنية (السدود)',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 343,
            'speciality' => 'إعادة تأهيل منشآت الصرف الصحي',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 344,
            'speciality' => 'إستغلال أنظمة التزويد بالماء الشروب',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 345,
            'speciality' => 'استغلال وصيانة أنظمة الصرف الصحي',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 346,
            'speciality' => 'استغلال محطات معالجة المياه',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 347,
            'speciality' => 'معالجة المياه',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 348,
            'speciality' => 'تسيير و اقتصاد الماء',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 349,
            'speciality' => 'البيئة',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 350,
            'speciality' => 'تسيير و استرجاع النفايات',
            'division' => 'مهن المياه والبينة',
        ],
        [
            'id' => 351,
            'speciality' => 'النسج والحياكة',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 352,
            'speciality' => 'تركيب و تصليح النظارات',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 353,
            'speciality' => 'تصليح الساعات',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 354,
            'speciality' => 'مغسلة و التنظيف الجاف',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 355,
            'speciality' => 'حلاقة الرجال',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 356,
            'speciality' => 'حلاقة نساء',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 357,
            'speciality' => 'ماكياج مانيكير',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 358,
            'speciality' => 'التجميل',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 359,
            'speciality' => 'مساعدة حضانة',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 360,
            'speciality' => 'مربية الطفولة الأولى',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 361,
            'speciality' => 'تجميل و حلاقة',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 362,
            'speciality' => 'التجميل و مستحضرات التحميل',
            'division' => 'مهن الخدمات',
        ],
        [
            'id' => 363,
            'speciality' => 'مفتت في المناجم',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 364,
            'speciality' => 'الوقاية و الأمن المنجمي',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 365,
            'speciality' => 'سائق آليات إستغلال المناجم',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 366,
            'speciality' => 'منجمي في المحاجر',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 367,
            'speciality' => 'حفار في المناجم',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 368,
            'speciality' => 'مسبار في المحاجر',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 369,
            'speciality' => 'تقني المناجم',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 370,
            'speciality' => 'الطوبوغرافي في المناجم (مساح)',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 371,
            'speciality' => 'مسير الإنشاءات لمعالجة الركاز',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 372,
            'speciality' => 'جيولوجي المناجم',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 373,
            'speciality' => 'مخبري في المناجم والمحاجر',
            'division' => 'المناجم والمحاجر',
        ],
        [
            'id' => 374,
            'speciality' => 'الفلكنة و هندسة العجلات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 375,
            'speciality' => 'توازي وموازنة العجلات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 376,
            'speciality' => 'ميكانيك تصليح الدراجات العادية والنارية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 377,
            'speciality' => 'ميكانيك تصليح أليات الورشات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 378,
            'speciality' => 'ميكانيك تصليح الآلات الفلاحية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 379,
            'speciality' => 'ميكانيك تصليح قوارب الصيد و اليخت',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 380,
            'speciality' => 'قيادة و صيانة الآلات الفلاحية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 381,
            'speciality' => 'قيادة و صيانة أليات الورشات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 382,
            'speciality' => 'ميكانيك تصليح عتاد الري',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 383,
            'speciality' => 'سائق النقالة',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 384,
            'speciality' => 'قيادة اليات أشغال الطرقات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 385,
            'speciality' => 'ميكانيك تصليح مركبات الوزن الخفيف',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 386,
            'speciality' => 'ميكانيك تصليح المركبات الصناعية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 387,
            'speciality' => 'ميكانيك تصليح أنظمة الضغط الهوائي و الهيدرولبكبة',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 388,
            'speciality' => 'ميكانيك تصليح تجهيزات حقن الديازل',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 389,
            'speciality' => 'ميكانيك وتصليح اليات المحاجر',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 390,
            'speciality' => 'مشعل الرافعة',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 391,
            'speciality' => 'ميكانيك وتصليح اليات البحرية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 392,
            'speciality' => 'صيانة مركبات الوزن الخفيف',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 393,
            'speciality' => 'صيانة آليات الورشات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 394,
            'speciality' => 'صيانة أليات الفلاحة',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 395,
            'speciality' => 'صيانة قوارب الصيد و اليخت',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 396,
            'speciality' => 'التصليح وصيانة المضخات والتجهيزات الهيدروليكية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 397,
            'speciality' => 'تركيب وصيانه عتاد الري',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 398,
            'speciality' => 'صيانة المركبات الصناعية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 399,
            'speciality' => 'ميكاترونيك السيارات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 400,
            'speciality' => 'صيانة اليات الورشات',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 401,
            'speciality' => 'صيانة الآلات الفلاحية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 402,
            'speciality' => 'تصليح وصيانة المضخات والتجهيزات الهيدروليكية',
            'division' => 'ميكانيك المحركات و الآليات',
        ],
        [
            'id' => 403,
            'speciality' => 'تربية الأسماك في الأحواض',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 404,
            'speciality' => 'تربية المحار',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 405,
            'speciality' => 'معالجة المنتجات السمكية',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 406,
            'speciality' => 'مرمم شباك الصيد',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 407,
            'speciality' => 'تربية أسماك الزينة',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 408,
            'speciality' => 'تربية المائيات',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 409,
            'speciality' => 'تربية اسماك الزينة',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 410,
            'speciality' => 'تربية المائيات',
            'division' => 'الصيد البحري و تربية المائيات',
        ],
        [
            'id' => 411,
            'speciality' => 'عامل المقسم الهاتفي',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 412,
            'speciality' => 'مساعد تقني متخصص في المكتبات، التوثيق و الأرشيف',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 413,
            'speciality' => 'أمين مخزن',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 414,
            'speciality' => 'عون إدراج المعلومات',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 415,
            'speciality' => 'المحاسبة',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 416,
            'speciality' => 'البنوك',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 417,
            'speciality' => 'التأمينات',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 418,
            'speciality' => 'الأمانة',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 419,
            'speciality' => 'مستشار البيع',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 420,
            'speciality' => 'تجاري (تجارة)',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 421,
            'speciality' => 'العبور و الجمركة',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 422,
            'speciality' => 'الأمانة المكتبية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 423,
            'speciality' => 'المحاسية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 424,
            'speciality' => 'التقنيات المحاسبة',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 425,
            'speciality' => 'الشراء و التموين',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 426,
            'speciality' => 'تسيير المخزونات',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 427,
            'speciality' => 'البنوك',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 428,
            'speciality' => 'الن أمينات',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 429,
            'speciality' => 'الاقتصاد و القانون',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 430,
            'speciality' => 'تسيير المخزنات و اللوجستيك',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 431,
            'speciality' => 'التوثيق و الأرشيف',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 432,
            'speciality' => 'التجارة الدولية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 433,
            'speciality' => 'التسويق',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 434,
            'speciality' => 'أمانة المديرية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 435,
            'speciality' => 'المحاسبة و التسيير',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 436,
            'speciality' => 'البنوك',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 437,
            'speciality' => 'التأمينات',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 438,
            'speciality' => 'تسيير الموارد البشرية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 439,
            'speciality' => 'المحاسبة و الملية',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 440,
            'speciality' => 'تسيير تجارة التجزئة',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 441,
            'speciality' => 'الإستشارة عن بعد',
            'division' => 'تقنيات الإدارة و التسيير',
        ],
        [
            'id' => 442,
            'speciality' => 'التصوير',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 443,
            'speciality' => 'المشغل الإسقاطي',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 444,
            'speciality' => 'السمعي البصري / خيار: التقاط الصورة',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 445,
            'speciality' => 'السمعي البصري / خيار: التقاط الصوت',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 446,
            'speciality' => 'السمعي البصري / خيار: تركيب',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 447,
            'speciality' => 'تقنيات استغلال تجهيزات السمعي البصري',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 448,
            'speciality' => 'تقنيات السمعي البصري / خيار : الصورة',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 449,
            'speciality' => 'تقنيات السمعي البصري/ خيار : الصوت',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 450,
            'speciality' => 'تقنيات السمعي البصري/ خيار : التركيب',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 451,
            'speciality' => 'تقنيات استغلال و صيانة التجهيزات السمعية البصرية',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 452,
            'speciality' => 'السمعي البصري/ خيار: تسيير الإنتاج',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 453,
            'speciality' => 'السمعي البصري/ خيار: التركيب و ما بعد الإنتاج',
            'division' => 'تقنيات السمعي البصري',
        ],
        [
            'id' => 454,
            'speciality' => 'إنتاج النسيج/ خيار: الحياكة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 455,
            'speciality' => 'إنتاج النسيج/ خيار: الغزل',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 456,
            'speciality' => 'إنتاج النسيج/ خيار: التلفيف، التجميع و إعادة الفئل',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 457,
            'speciality' => 'إنتاج النسيج/ خيار: تحضير الغزل',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 458,
            'speciality' => 'تحضير الأنسجة / خيار: التسدية - التبويش',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 459,
            'speciality' => 'تحضير الأنسجه / خيار:عاقد- مركب',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 460,
            'speciality' => 'تحضير الأنسجة / خيار: تركيب مركب السلسلة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 461,
            'speciality' => 'منظف و مشحم تجهيزات الغزل',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 462,
            'speciality' => 'منظف و مشحم تجهيزات النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 463,
            'speciality' => 'ميكانيك تصليح الات الغرز',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 464,
            'speciality' => 'ميكانيك تصليح آلات الخياطة و الحياكة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 465,
            'speciality' => 'التفصيل الصناعي',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 466,
            'speciality' => 'الخياطة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 467,
            'speciality' => 'خياطة الألبسة الجاهزة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 468,
            'speciality' => 'صناعة الأنسجة / خيار : معالجة الأنسجة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 469,
            'speciality' => 'ميكانيك ضبط الات النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 470,
            'speciality' => 'ميكانيك ضبط آلات العزل',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 471,
            'speciality' => 'ميكانيك ضبط ألات معالجة الأنسجة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 472,
            'speciality' => 'ميكانيك ضبط آلات و تحضير النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 473,
            'speciality' => 'ميكانيك الضبط تجهيزات النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 474,
            'speciality' => 'خياط ألبسة السيدات',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 475,
            'speciality' => 'خياط ألبسة الرجال',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 476,
            'speciality' => 'نموذج التدرج في صناعة الألبسة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 477,
            'speciality' => 'أساليب الملابس',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 478,
            'speciality' => 'أساليب النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 479,
            'speciality' => 'تنظيم و إطلاق النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 480,
            'speciality' => 'صناعة الأنسجة / خيار: معالجة النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 481,
            'speciality' => 'صناعة الأنسجة / خيار: هياكل النسيج',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 482,
            'speciality' => 'تصميم الأزياء',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 483,
            'speciality' => 'تسيير إنتاج الألبسة',
            'division' => 'النسيج والألبسة',
        ],
        [
            'id' => 484,
            'speciality' => 'صيانة تجهيزات صناعة الألبسة',
            'division' => 'النسيج والألبسة',
        ],
    ];
}
